---
kind: other
id: Properties.T:Autodesk.Revit.DB.CurveByPointsArrayIterator
source: html/557d0fea-ddd2-1a59-464c-4f08c2497dd4.htm
---
# CurveByPointsArrayIterator Properties

Retrieves the item that is the current focus of the iterator.